Repository: Synon1003/EducationPortal
Catalog: EducationPortal.Web/LanguageResources/Resource.*.resx
Languages: hu

# ApplicationName
source: Education Portal
hu: OktatóFelület

source: Materials
hu: Tananyagok

source: Videos
hu: Videók

source: Publications
hu: Kiadványok

source: Articles
hu: Cikkek

source: Mark as Done
hu: Késznek Jelölés

source: Done
hu: Kész

source: Back
hu: Vissza

source: Courses
hu: Tanfolyamok

source: Course Details
hu: Tanfolyam Részletek

source: New
hu: Új

source: All
hu: Mind

source: Available
hu: Elérhető

source: In-Progress
hu: Folyamatban

source: Completed
hu: Befejezett

source: Created
hu: Létrehozott

source: Registered Courses
hu: Regisztrált Tanfolyamok

source: Available Courses
hu: Elérhető Tanfolyamok

source: In-Progress Courses
hu: Folyamatban Lévő Tanfolyamok

source: Completed Courses
hu: Befejezett Tanfolyamok

source: Created Courses
hu: Létrehozott Tanfolyamok

source: Name
hu: Név

# NameIsRequiredError
source: Name is required.
hu: Név kitöltése kötelező.

source: Description
hu: Leírás

# DescriptionIsRequiredError
source: Description is required.
hu: Leírás kitöltése kötelező.

source: Skills
hu: Ismeretek

source: Created By
hu: Létrehozta

source: Progress
hu: Haladás

source: Create Course
hu: Tanfolyam Létrehozása

source: Load
hu: Betöltés

source: Delete
hu: Törlés

source: Create
hu: Létrehozás

source: Title
hu: Cím

source: Duration
hu: Időtartam

source: Quality
hu: Minőség

source: Authors
hu: Szerzők

source: Pages
hu: Oldalak

source: Format
hu: Formátum

source: Publication Year
hu: Megjelenés Éve

source: Publication Date
hu: Megjelenés Dátuma

source: Resource Link
hu: Forrás Link

# TitleIsRequiredError
source: Title is required.
hu: Cím kitöltése kötelező.

# DurationIsRequiredError
source: Duration is required.
hu: Időtartam kitöltése kötelező.

# QualityIsRequiredError
source: Quality is required.
hu: Minőség kitöltése kötelező.

# AuthorsIsRequiredError
source: Authors is required.
hu: Szerzők kitöltése kötelező.

# PagesIsRequiredError
source: Pages is required.
hu: Oldalak kitöltése kötelező.

# FormatIsRequiredError
source: Format is required.
hu: Formátum kitöltése kötelező.

# PublicationYearIsRequiredError
source: Publication Year is required.
hu: Megjelenés Éve kitöltése kötelező.

# PublicationDateIsRequiredError
source: Publication Date is required.
hu: Megjelenés Dátuma kitöltése kötelező.

# ResourceLinkIsRequiredError
source: Resource Link is required.
hu: Forrás Link kitöltése kötelező.

source: Select Skill
hu: Válassz Ismeretet

source: Search
hu: Keresés

source: Skill
hu: Ismeret

source: Level
hu: Szint

# AcquiredCount
source: Acquired by
hu: Megszerezték

source: Highest Acquired Level
hu: Legmagasabb Megszerzett Szint

source: Select Video
hu: Válassz Videót

source: Select Publication
hu: Válassz Kiadványt

source: Select Article
hu: Válassz Cikket

source: Profile
hu: Profil

source: Logout
hu: Kilépés

source: First Name
hu: Keresztnév

# FirstNameIsRequiredError
source: First Name is required.
hu: Keresztnév kitöltése kötelező.

source: Last Name
hu: Vezetéknév

# LastNameIsRequiredError
source: Last Name is required.
hu: Vezetéknév kitöltése kötelező.

source: Email
hu: Emailcím

# EmailIsRequiredError
source: Email is required.
hu: Emailcím kitöltése kötelező.

# EmailFormatError
source: Email should be in email address format.
hu: Emailcím csak emailcím formátumban szerepelhet.

# EmailIsAlreadyTakenError
source: Email is already taken.
hu: Ez az emailcím már létezik.

source: Enroll
hu: Jelentkezés

source: Leave
hu: Lejelentkezés

# RegistrationFailedFlash
source: Registration failed.
hu: Sikertelen regisztráció.

# AccountCreatedSuccessfullyYouAreNowLoggedInFlash
source: Account created successfully. You are now logged in.
hu: A fiók sikeresen létrejött. Be vagy jelentkezve.

# LogInFailedFlash
source: Login failed.
hu: Sikertelen bejelentkezés.

# LoggedInSuccessfullyFlash
source: Logged in successfully.
hu: Sikeres bejelentkezés.

# LoggedOutSuccessfullyFlash
source: Logged out successfully.
hu: Sikeres kijelentkezés.

# CourseCreationFailedFlash
source: Course creation failed.
hu: A tanfolyam létrehozása sikertelen.

# CourseCreatedSuccessfullyFlash
source: Course created successfully.
hu: A tanfolyam létrehozása sikeres.

# CongratulationsYouPassedSuccessfullyFlash
source: Congratulations! You passed successfully.
hu: Gratulálok! A tanfolyamot sikeresen teljesítetted.

# YouEnrolledSuccessfullyFlash
source: You enrolled successfully.
hu: Sikeresen jelentkeztél.

# YouLeftTheCourseSuccessfullyFlash
source: You left the course successfully.
hu: Sikeresen lejelentkeztél a tanfolyamról.

# MaterialMarkedAsDoneFlash
source: Material marked as Done.
hu: A tananyagot Késznek jelölted.

source: Invalid email or password.
hu: Hibás email vagy jelszó.

# CourseName_IsAlreadyTaken
source: Course name ({0}) is already taken.
hu: Ez a tanfolyamnév ({0}) már létezik.

# SkillName_IsAlreadyTaken
source: Skill name ({0}) is already taken.
hu: Ez az ismeret ({0}) már létezik.

# SkillName_IsDuplicated
source: Skill name ({0}) is duplicated.
hu: Ezt az ismeretnevet ({0}) többször adtad meg.

# VideoTitle_IsAlreadyTaken
source: Video title ({0}) is already taken.
hu: Ez a videócím ({0}) már létezik.

# VideoTitle_IsDuplicated
source: Video title ({0}) is duplicated.
hu: Ezt a videócímet ({0}) többször adtad meg.

# PublicationTitle_IsAlreadyTaken
source: Publication title ({0}) is already taken.
hu: Ez a kiadványcím ({0}) már létezik.

# PublicationTitle_IsDuplicated
source: Publication title ({0}) is duplicated.
hu: Ezt a kiadványcímet ({0}) többször adtad meg.

# ArticleTitle_IsAlreadyTaken
source: Article title ({0}) is already taken.
hu: Ez a cikkcím ({0}) már létezik.

# ArticleTitle_IsDuplicated
source: Article title ({0}) is duplicated.
hu: Ezt a cikknevet ({0}) többször adtad meg.

# HomeHeader
source: Education Portal
hu: OktatóFelület

# HomeSubHeader
source: Your gateway to knowledge and learning
hu: A tudás és tanulás kapuja

# HomeWelcomeText
source: Improve your skills by completing various courses or create courses to teach your friends
hu: Fejleszd az ismereteid különféle tanfolyamok elvégzésével, vagy hozz létre saját tanfolyamokat, hogy tanítsd a barátaidat

# HomeAdviceHeader
source: Create your own course
hu: Készítsd el a saját tanfolyamod

# HomeAdviceText
source: Label the skills it touches upon and provide the materials
hu: Címkézd fel a kapcsolódó ismereteket, és add meg a tananyagokat

# ExampleGitCourseDescription
source: A course to teach you how to collaborate with others on gitlab
hu: A tanfolyam megtanít együttműködni másokkal a gitlab felületén

# ExampleDotnetCourseName
source: Dotnet course
hu: Dotnet tanfolyam

# ExampleDotnetCourseDescription
source: A course to create Asp.Net Core MVC applications
hu: Egy tanfolyam Asp.Net Core MVC alkalmazások készítésére

# ExampleAnswersCourseDescription
source: Learn to choose between multiple correct answers quickly
hu: Tanuld meg sok helyes válaszból gyorsan kiválasztani a leghelyesebbet

# ExampleAnswersCourseSkills
source: Speed reading
hu: Villámolvasás

# SomethingWentWrongError
source: Oops! Something went wrong.
hu: Hoppá! Valami rosszul sült el.

# UnexpectedError
source: An unexpected error occurred. Please try again later.
hu: Váratlan hiba történt. Kérlek, próbáld meg később.

# SqlError
source: We are having trouble connecting to the database. Please try again later.
hu: Problémák merültek fel az adatbáziskapcsolattal. Kérlek, próbáld meg később.

# ForbiddenError
source: You do not have permission to access this resource. Please contact the administrator.
hu: Nincs jogosultságod az erőforrás eléréséhez. Fordulj a rendszergazdához.

# XFetchBadRequestError
source: The request could not be processed. Please make sure the data is correct.
hu: A kérést nem lehet kiszolgálni. Kérlek ellenőrizd a megadott adatokat.

source: Sign Up
hu: Regisztrálj

source: Home
hu: Főoldal

source: Error
hu: Hiba

source: Register
hu: Regisztráció

source: Login
hu: Bejelentkezés

source: I already have an account
hu: Már van fiókom

source: Do not have an account?
hu: Nincs még fiókod?

source: Password
hu: Jelszó

# PasswordIsRequiredError
source: Password is required.
hu: Jelszó kitöltése kötelező.

source: Confirm Password
hu: Megerősítő Jelszó

# ConfirmPasswordIsRequiredError
source: Confirm Password is required.
hu: Megerősítő Jelszó kitöltése kötelező.

# PasswordAndConfirmPasswordDoNotMatchError
source: Password and Confirm Password do not match.
hu: "A jelszó és megerősítő jelszó nem egyezik."

source: Passwords must be at least 8 characters.
hu: A jelszó legalább 8 karakterhosszúságú kell legyen.

source: Passwords must have at least one non alphanumeric character.
hu: A jelszónak legalább egy nem alfanumerikus karaktert tartalmaznia kell.

# Passwords must have at least one lowercase _.
source: Passwords must have at least one lowercase ({0}).
hu: A jelszónak legalább egy kisbetűt tartalmaznia kell ({0}).

# Passwords must have at least one uppercase _.
source: Passwords must have at least one uppercase ({0}).
hu: A jelszónak legalább egy nagybetűt tartalmaznia kell ({0}).

source: Passwords must use at least 5 different characters.
hu: A jelszó legalább 5 különböző karaktert kell tartalmazzon.

# AtLeastOneMaterialError
source: At least one Material (Video, Publication, or Article) must be provided to create a Course.
hu: Tanfolyam létrehozásához legalább egy tananyag (Videó, Kiadvány, vagy Cikk) megadása szükséges.
